#The Apache HBase Shell
The Apache HBase Shell是在(J)Ruby's IRB的基础上加了些特定地HBase命令，能在IRB中执行的，在HBase shell中也开以执行。

要运行HBase Shell，执行下面语句：
>  $ ./bin/hbase shell

输入_help_就会返回命令和选项表，至少看下文档末尾如何输入变量和命令参数到HBase Shell中，特别注意表名、行、列等要用单引号

See shell exercises for example basic shell operation.

Here is a nicely formatted listing of all shell commands by Rajeshbabu Chintaguntla.

##14. Ruby脚本
到HBase bin目录下看下HBase脚本的例子，找到以*.rb结尾的文件。运行其中一个一下面的格式：
> ./bin/hbase org.jruby.Main PATH_TO_SCRIPT

##15. 非交互式运行Shell
一种新的非交互式的模式被加入到HBase Shell中。非交互式模式捕捉HBase Shell命令的退出状态（成功或失败）并将状态传递给命令解释器。如果使用普通的交互模式，HBase Shell将只会返回它自己的退出状态，几乎总是0代表成功。

要使用非交互式模式输入**-n** 或 **--non-interactive**选项在HBase Shell中

##16. 操作系统脚本中的HBase Shell 
也可以在操作系统脚本语言解释器中使用HBase Shell，如UNIX/LINUX中默认的Bash中，下面的guidelines使用Bash的句法（syntax），也可以调整成C风格的Shell如csh或tcsh，可能也可以修改成微软Windows风格脚本。Submissions are welcome.

> 这种方式产生（spawning？）HBase Shell比较慢，所以当你要好好想想什么时候合适将二者结合（Hbase操作和操作系统命令行）

**Example 8. Passing Commands to the HBase Shell**

> 使用_**echo**_或者**管道**_**' | '**_可以将命令传递给非交互式的HBase Shell，注意Hbase命令中的转移字符（escape characters）不然它们可能被shell解释。下面的例子中一些调试级输出被截获

>     $ echo "describe 'test1'" | ./hbase shell -n

>    Version 0.98.3-hadoop2, rd5e65a9144e315bb0a964e7730871af32f5018d5, Sat May 31 19:56:09 PDT 2014

>    describe 'test1'

>    DESCRIPTION                                          ENABLED
>     'test1', {NAME => 'cf', DATA_BLOCK_ENCODING => 'NON true
>      E', BLOOMFILTER => 'ROW', REPLICATION_SCOPE => '0',
>       VERSIONS => '1', COMPRESSION => 'NONE', MIN_VERSIO
>      NS => '0', TTL => 'FOREVER', KEEP_DELETED_CELLS =>
>     'false', BLOCKSIZE => '65536', IN_MEMORY => 'false'
>      , BLOCKCACHE => 'true'}
>     1 row(s) in 3.2410 seconds

> To suppress all output, echo it to /dev/null:

>     $ echo "describe 'test'" | ./hbase shell -n > /dev/null 2>&1

**Example 9. Checking the Result of a Scripted Command**

> 由于脚本被设计以交互式运行，你需要一种新的方式去检查你的命令是否成功。HBase hell使用标准的返回0代表运行成功，而非零代表失败。Bash在一个特殊的环境变量（$？）中存放命令的返回值.因每次运行命令，这个变量都会被覆盖，所以我们应该把结果存放到一个不同的、脚本定义的变量中。

> 下面简单的脚本是一种存储返回值并利用它做操作的方法

>      #!/bin/bash
      echo "describe 'test'" | ./hbase shell -n > /dev/null 2>&1
      status=$?
      echo "The status was " $status
      if ($status == 0); then
          echo "The command succeeded."
      else
          echo "The command may have failed."
      fi
      return $status

###16.1. 脚本中检查结果
得到退出码0一定代表脚本命令执行成功。而得到非零值不一定意味着执行失败。命令可能成功了，但客户端失去联系或者其他事情隐藏来成功的结果。这是因为RPC命令是stateless（Of a system or protocol, such that it does not keep a persistent state between transactions.对系统或协议，这表示业务不会保持持久的状态）。唯一确定操作的状态是去检查。例如，你的脚本创建来一个表，返回一个非零值，你应该在再次创建之前检查下这个表是否真创建了。

##17. 从命令文件读取HBase Shell命令
可以将HBase Shell写入一个文本文件。一个命令一行，并将文件输入到HBase Shell

**Example 10. Example Command File**

    creat 'test', 'cf'
    list 'test'
    put 'test', 'row1', 'cf:a', 'value1'
    put 'test', 'row2', 'cf:b', 'value2'
    put 'test', 'row3', 'cf:c', 'value3'
    put 'test', 'row4', 'cf:d', 'value4'
    scan 'test'
    get 'test', 'row1'
    disable 'test'
    enable 'test'
    
**Example 11. Directing HBase Shell to Execute the Commands**

> 将路径作为Hbase shell命令的唯一参数传递给它。每个命令会被执行，结果如下。如果脚本中没有exit命令，将返回到Hbase shell命令行中。不能以编程的方式（programmatically）检查每个命令的结果。同样，即使你看到每个命令的输出，但每个命令本身没有在屏幕中对应(echoed),也很难将命令和输出对等起来。

>   $ ./hbase shell ./sample_commands.txt

>   0 row(s) in 3.4170 seconds

> TABLE

> test

> 1 row(s) in 0.0590 seconds

> 0 row(s) in 0.1540 seconds

> 0 row(s) in 0.0080 seconds

> 0 row(s) in 0.0060 seconds

> 0 row(s) in 0.0060 seconds 
 
> ROW                   COLUMN+CELL
 
> row1                 column=cf:a, timestamp=1407130286968, value=value1

> row2                 column=cf:b, timestamp=1407130286997, value=value2

> row3                 column=cf:c, timestamp=1407130287007, value=value3

> row4                 column=cf:d, timestamp=1407130287015, value=value4

> 4 row(s) in 0.0420 seconds

> COLUMN                CELL

>  cf:a                 timestamp=1407130286968, value=value1

> 1 row(s) in 0.0110 seconds

> 0 row(s) in 1.5630 seconds

> 0 row(s) in 0.4360 seconds

##18. Passing VM Options to the Shell
使用环境变量**HBASE_SHELL_OPTS**可以将VM选项传递给Hbase shell，也可以同感编辑～/.bashrc来设置这个，或将这个作为登录Hbase shell的一个参数。下面例子设置了几个garbage-collection-related变量，它们只在这次VM运行HBase shell有用。命令应该写在一行之内，如果要断行利用 \ 

> $ HBASE_SHELL_OPTS="-verbose:gc -XX:+PrintGCApplicationStoppedTime -XX:+PrintGCDateStamps \
  -XX:+PrintGCDetails -Xloggc:$HBASE_HOME/logs/gc-hbase.log" ./bin/hbase shell

##19. Shell技巧

###19.1. Table variables

HBase 0.95加入shell命令，它为表提供了jruby风格的面向对象的引用，之前所有针对表的shell命令都是一种程序型风格，即使用表名作为一个变量。HBase0.95引开始可以将一个表存入一个jruby变量中，引用表可以用来展示数据的读写操作，像puts、scans以及gets、管理功能如disabling、删除、describing表。

例如，之前你总要指定表名：

    hbase(main):000:0> create ‘t’, ‘f’
    0 row(s) in 1.0970 seconds
    hbase(main):001:0> put 't', 'rold', 'f', 'v'
    0 row(s) in 0.0080 seconds
    
    hbase(main):002:0> scan 't'
    ROW                                COLUMN+CELL
     rold                              column=f:, timestamp=1378473207660, value=v
    1 row(s) in 0.0130 seconds

    hbase(main):003:0> describe 't'
    DESCRIPTION                                                                           ENABLED
    't', {NAME => 'f', DATA_BLOCK_ENCODING => 'NONE', BLOOMFILTER => 'ROW', REPLICATION_ true
    SCOPE => '0', VERSIONS => '1', COMPRESSION => 'NONE', MIN_VERSIONS => '0', TTL => '2
    147483647', KEEP_DELETED_CELLS => 'false', BLOCKSIZE => '65536', IN_MEMORY => 'false
    ', BLOCKCACHE => 'true'}
    1 row(s) in 1.4430 seconds

    hbase(main):004:0> disable 't'
    0 row(s) in 14.8700 seconds

    hbase(main):005:0> drop 't'
    0 row(s) in 23.1670 seconds

    hbase(main):006:0>
